leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/arm/arm_cr4/drivers/tms570ls12x_portdefs.h
/*-------------------------------- Arctic Core ------------------------------
 * Copyright (C) 2013, ArcCore AB, Sweden, www.arccore.com.
 * Contact: <contact@arccore.com>
 *
 * You may ONLY use this file:
 * 1)if you have a valid commercial ArcCore license and then in accordance with
 * the terms contained in the written license agreement between you and ArcCore,
 * or alternatively
 * 2)if you follow the terms found in GNU General Public License version 2 as
 * published by the Free Software Foundation and appearing in the file
 * LICENSE.GPL included in the packaging of this file or here
 * <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>
 *-------------------------------- Arctic Core -----------------------------*/

#ifndef TMS570_PORTDEFS_H_
#define TMS570_PORTDEFS_H_

#define PWM_IOMM_KICK0 0xFFFFEA38
#define PWM_IOMM_KICK1 0xFFFFEA3C

// There are 48 PINMMR registers, each is 32 bits
// PINMMR37 and PINMMR38 are used to enable/disable PWM

#define PIN_FUNCTION_AD1EVT PORT_FUNC0
#define PIN_FUNCTION_AD2EVT PORT_FUNC1
#define PIN_FUNCTION_AWM_EXT_ENA PORT_FUNC1
#define PIN_FUNCTION_AWM_EXT_SEL_0 PORT_FUNC1
#define PIN_FUNCTION_AWM_EXT_SEL_1 PORT_FUNC1
#define PIN_FUNCTION_ECAP1 PORT_FUNC2
#define PIN_FUNCTION_ECAP2 PORT_FUNC2
#define PIN_FUNCTION_ECAP3 PORT_FUNC2
#define PIN_FUNCTION_ECAP4 PORT_FUNC4
#define PIN_FUNCTION_ECAP5 PORT_FUNC5
#define PIN_FUNCTION_ECAP6 PORT_FUNC4
#define PIN_FUNCTION_EMIF_ADDR_0 PORT_FUNC0
#define PIN_FUNCTION_EMIF_ADDR_1 PORT_FUNC0
#define PIN_FUNCTION_EMIF_ADDR_6 PORT_FUNC0
#define PIN_FUNCTION_EMIF_ADDR_7 PORT_FUNC0
#define PIN_FUNCTION_EMIF_ADDR_8 PORT_FUNC0
#define PIN_FUNCTION_EMIF_ADDR_8 PORT_FUNC0
#define PIN_FUNCTION_EMIF_BA_1 PORT_FUNC0
#define PIN_FUNCTION_EMIF_DATA_11 PORT_FUNC0
//#define PIN_FUNCTION_EMIF_DATA_11 PORT_FUNC1
#define PIN_FUNCTION_EMIF_NCS_0 PORT_FUNC0
#define PIN_FUNCTION_EMIF_NCS_3 PORT_FUNC0
#define PIN_FUNCTION_EMIF_NWE PORT_FUNC0
#define PIN_FUNCTION_EMIF_RNW PORT_FUNC1
#define PIN_FUNCTION_ETPWM4A PORT_FUNC2
#define PIN_FUNCTION_EQEP1A PORT_FUNC2
#define PIN_FUNCTION_EQEP1B PORT_FUNC3
#define PIN_FUNCTION_EQEP1I PORT_FUNC3
#define PIN_FUNCTION_EQEP1S PORT_FUNC4
#define PIN_FUNCTION_EQEP2A PORT_FUNC5
#define PIN_FUNCTION_EQEP2B PORT_FUNC5
#define PIN_FUNCTION_EQEP2I PORT_FUNC4
#define PIN_FUNCTION_EQEP2S PORT_FUNC3
#define PIN_FUNCTION_ETPWM1A PORT_FUNC2
#define PIN_FUNCTION_ETPWM1B PORT_FUNC2
#define PIN_FUNCTION_ETPWM1SYNCI PORT_FUNC1
#define PIN_FUNCTION_ETPWM1SYNCO PORT_FUNC2
//#define PIN_FUNCTION_ETPWM1SYNCO PORT_FUNC5
#define PIN_FUNCTION_ETPWM2A PORT_FUNC2
#define PIN_FUNCTION_ETPWM2B PORT_FUNC2
#define PIN_FUNCTION_ETPWM3A PORT_FUNC2
#define PIN_FUNCTION_ETPWM3B PORT_FUNC3
#define PIN_FUNCTION_ETPWM4B PORT_FUNC1
#define PIN_FUNCTION_ETPWM5A PORT_FUNC2
#define PIN_FUNCTION_ETPWM5B PORT_FUNC2
#define PIN_FUNCTION_ETPWM6A PORT_FUNC1
#define PIN_FUNCTION_ETPWM6B PORT_FUNC1
#define PIN_FUNCTION_ETPWM7A PORT_FUNC4
#define PIN_FUNCTION_ETPWM7B PORT_FUNC4
#define PIN_FUNCTION_EXTCLKIN PORT_FUNC1
#define PIN_FUNCTION_GIOA_0 PORT_FUNC0
#define PIN_FUNCTION_GIOA_1 PORT_FUNC0
#define PIN_FUNCTION_GIOA_2 PORT_FUNC0
#define PIN_FUNCTION_GIOA_3 PORT_FUNC0
#define PIN_FUNCTION_GIOA_4 PORT_FUNC0
#define PIN_FUNCTION_GIOA_5 PORT_FUNC0
#define PIN_FUNCTION_GIOA_6 PORT_FUNC0
#define PIN_FUNCTION_GIOA_7 PORT_FUNC0
#define PIN_FUNCTION_GIOB_0 PORT_FUNC0
#define PIN_FUNCTION_GIOB_1 PORT_FUNC0
#define PIN_FUNCTION_GIOB_2 PORT_FUNC0
#define PIN_FUNCTION_GIOB_3 PORT_FUNC0
#define PIN_FUNCTION_GIOB_4 PORT_FUNC0
#define PIN_FUNCTION_GIOB_5 PORT_FUNC0
#define PIN_FUNCTION_GIOB_6 PORT_FUNC0
#define PIN_FUNCTION_GIOB_7 PORT_FUNC0
#define PIN_FUNCTION_I2C_SCL PORT_FUNC1
#define PIN_FUNCTION_I2C_SDA PORT_FUNC1
#define PIN_FUNCTION_MDCLK PORT_FUNC2
#define PIN_FUNCTION_MDIO PORT_FUNC2
#define PIN_FUNCTION_MIBSPI1NCS_0 PORT_FUNC0
#define PIN_FUNCTION_MIBSPI1NCS_1 PORT_FUNC0
#define PIN_FUNCTION_MIBSPI1NCS_2 PORT_FUNC0
#define PIN_FUNCTION_MIBSPI1NCS_3 PORT_FUNC0
#define PIN_FUNCTION_MIBSPI1NCS_4 PORT_FUNC1
#define PIN_FUNCTION_MIBSPI1NCS_5 PORT_FUNC1
#define PIN_FUNCTION_MIBSPI1NENA PORT_FUNC0
#define PIN_FUNCTION_MIBSPI1SIMO_1 PORT_FUNC1
#define PIN_FUNCTION_MIBSPI1SOMI_1 PORT_FUNC1
#define PIN_FUNCTION_MIBSPI3CLK PORT_FUNC0
#define PIN_FUNCTION_MIBSPI3NCS_0 PORT_FUNC0
#define PIN_FUNCTION_MIBSPI3NCS_1 PORT_FUNC0
#define PIN_FUNCTION_MIBSPI3NCS_2 PORT_FUNC0
#define PIN_FUNCTION_MIBSPI3NCS_3 PORT_FUNC0
#define PIN_FUNCTION_MIBSPI3NCS_4 PORT_FUNC1
#define PIN_FUNCTION_MIBSPI3NCS_5 PORT_FUNC1
#define PIN_FUNCTION_MIBSPI3NENA PORT_FUNC0
#define PIN_FUNCTION_MIBSPI3SIMO_0 PORT_FUNC0
#define PIN_FUNCTION_MIBSPI3SOMI_0 PORT_FUNC0
#define PIN_FUNCTION_MIBSPI5CLK PORT_FUNC0
#define PIN_FUNCTION_MIBSPI5NCS_0 PORT_FUNC0
#define PIN_FUNCTION_MIBSPI5NENA PORT_FUNC0
#define PIN_FUNCTION_MIBSPI5SIMO_0 PORT_FUNC0
#define PIN_FUNCTION_MIBSPI5SOMI_0 PORT_FUNC0
#define PIN_FUNCTION_MIBSPI5SOMI_1 PORT_FUNC4
#define PIN_FUNCTION_MIBSPI5SOMI_2 PORT_FUNC4
#define PIN_FUNCTION_MII_COL PORT_FUNC2
#define PIN_FUNCTION_MII_CRS PORT_FUNC1
#define PIN_FUNCTION_MII_RX_AVCLK4 PORT_FUNC3
#define PIN_FUNCTION_MII_RX_DV PORT_FUNC1
#define PIN_FUNCTION_MII_RX_ER PORT_FUNC1
#define PIN_FUNCTION_MII_RXCLK PORT_FUNC1
#define PIN_FUNCTION_MII_RXD_0 PORT_FUNC2
#define PIN_FUNCTION_MII_RXD_1 PORT_FUNC1
#define PIN_FUNCTION_MII_RXD_2 PORT_FUNC2
#define PIN_FUNCTION_MII_RXD_3 PORT_FUNC2
#define PIN_FUNCTION_MII_TX_AVCLK4 PORT_FUNC3
#define PIN_FUNCTION_MII_TX_CLK PORT_FUNC1
#define PIN_FUNCTION_MII_TXD_0 PORT_FUNC2
#define PIN_FUNCTION_MII_TXD_1 PORT_FUNC2
#define PIN_FUNCTION_MII_TXD_2 PORT_FUNC2
#define PIN_FUNCTION_MII_TXD_3 PORT_FUNC2
#define PIN_FUNCTION_MII_TXEN PORT_FUNC2
#define PIN_FUNCTION_N2HET1_0 PORT_FUNC0
#define PIN_FUNCTION_N2HET1_01 PORT_FUNC0
#define PIN_FUNCTION_N2HET1_02 PORT_FUNC0
#define PIN_FUNCTION_N2HET1_03 PORT_FUNC0
#define PIN_FUNCTION_N2HET1_04 PORT_FUNC0
#define PIN_FUNCTION_N2HET1_05 PORT_FUNC0
#define PIN_FUNCTION_N2HET1_06 PORT_FUNC0
#define PIN_FUNCTION_N2HET1_07 PORT_FUNC0
#define PIN_FUNCTION_N2HET1_08 PORT_FUNC0
#define PIN_FUNCTION_N2HET1_09 PORT_FUNC0
#define PIN_FUNCTION_N2HET1_10 PORT_FUNC0
#define PIN_FUNCTION_N2HET1_11 PORT_FUNC0
#define PIN_FUNCTION_N2HET1_12 PORT_FUNC0
#define PIN_FUNCTION_N2HET1_13 PORT_FUNC0
#define PIN_FUNCTION_N2HET1_15 PORT_FUNC0
#define PIN_FUNCTION_N2HET1_16 PORT_FUNC0
#define PIN_FUNCTION_N2HET1_17 PORT_FUNC1
#define PIN_FUNCTION_N2HET1_18 PORT_FUNC0
#define PIN_FUNCTION_N2HET1_19 PORT_FUNC1
#define PIN_FUNCTION_N2HET1_20 PORT_FUNC0
#define PIN_FUNCTION_N2HET1_21 PORT_FUNC1
#define PIN_FUNCTION_N2HET1_23 PORT_FUNC1
#define PIN_FUNCTION_N2HET1_24 PORT_FUNC0
#define PIN_FUNCTION_N2HET1_25 PORT_FUNC1
#define PIN_FUNCTION_N2HET1_26 PORT_FUNC0
#define PIN_FUNCTION_N2HET1_27 PORT_FUNC2
#define PIN_FUNCTION_N2HET1_28 PORT_FUNC0
#define PIN_FUNCTION_N2HET1_29 PORT_FUNC2
#define PIN_FUNCTION_N2HET1_30 PORT_FUNC0
#define PIN_FUNCTION_N2HET1_31 PORT_FUNC2
#define PIN_FUNCTION_N2HET2_0 PORT_FUNC3
#define PIN_FUNCTION_N2HET2_1 PORT_FUNC1
#define PIN_FUNCTION_N2HET2_10 PORT_FUNC4
#define PIN_FUNCTION_N2HET2_11 PORT_FUNC2
#define PIN_FUNCTION_N2HET2_12 PORT_FUNC2
#define PIN_FUNCTION_N2HET2_13 PORT_FUNC2
#define PIN_FUNCTION_N2HET2_14 PORT_FUNC3
#define PIN_FUNCTION_N2HET2_15 PORT_FUNC2
#define PIN_FUNCTION_N2HET2_15 PORT_FUNC2
#define PIN_FUNCTION_N2HET2_16 PORT_FUNC1
#define PIN_FUNCTION_N2HET2_18 PORT_FUNC2
#define PIN_FUNCTION_N2HET2_2 PORT_FUNC1
#define PIN_FUNCTION_N2HET2_3 PORT_FUNC1
#define PIN_FUNCTION_N2HET2_4 PORT_FUNC1
#define PIN_FUNCTION_N2HET2_5 PORT_FUNC1
#define PIN_FUNCTION_N2HET2_6 PORT_FUNC1
#define PIN_FUNCTION_N2HET2_7 PORT_FUNC2
#define PIN_FUNCTION_N2HET2_8 PORT_FUNC4
#define PIN_FUNCTION_N2HET2_9 PORT_FUNC2
#define PIN_FUNCTION_NTZ1 PORT_FUNC3
#define PIN_FUNCTION_NTZ2 PORT_FUNC3
#define PIN_FUNCTION_NTZ3 PORT_FUNC4
#define PIN_FUNCTION_RMII_CRS_DV PORT_FUNC2
#define PIN_FUNCTION_RMII_REFCLK PORT_FUNC2
#define PIN_FUNCTION_RMII_RX_ER PORT_FUNC2
#define PIN_FUNCTION_RMII_RXD_0 PORT_FUNC3
#define PIN_FUNCTION_RMII_RXD_1 PORT_FUNC2
#define PIN_FUNCTION_RMII_TXD_0 PORT_FUNC3
#define PIN_FUNCTION_RMII_TXD_1 PORT_FUNC3
#define PIN_FUNCTION_RMII_TXEN PORT_FUNC3
#define PIN_FUNCTION_SCIRX PORT_FUNC1
#define PIN_FUNCTION_SCITX PORT_FUNC1
#define PIN_FUNCTION_SPI2NCS_1 PORT_FUNC1
#define PIN_FUNCTION_SPI2NENA PORT_FUNC0
#define PIN_FUNCTION_SPI4CLK PORT_FUNC1
#define PIN_FUNCTION_SPI4NCS_0 PORT_FUNC1
#define PIN_FUNCTION_SPI4NENA PORT_FUNC1
#define PIN_FUNCTION_SPI4SIMO PORT_FUNC1
#define PIN_FUNCTION_SPI4SOMI PORT_FUNC1


