leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/arm/arm_cr4/drivers/tms570ls12x_portdefs.h
#define PIN_AD1EVT_REG_BIT  0
#define PIN_AD1EVT_REG_OFFSET 10
#define PIN_AD2EVT_REG_BIT 17
#define PIN_AD2EVT_REG_OFFSET 9
#define PIN_AWM_EXT_ENA_REG_BIT 9
#define PIN_AWM_EXT_ENA_REG_OFFSET 33
#define PIN_AWM_EXT_SEL_0_REG_BIT 17
#define PIN_AWM_EXT_SEL_0_REG_OFFSET 33
#define PIN_AWM_EXT_SEL_1_REG_BIT 25
#define PIN_AWM_EXT_SEL_1_REG_OFFSET 33
#define PIN_ECAP1_REG_BIT 18
#define PIN_ECAP1_REG_OFFSET 8
#define PIN_ECAP2_REG_BIT 10
#define PIN_ECAP2_REG_OFFSET 33
#define PIN_ECAP3_REG_BIT 18
#define PIN_ECAP3_REG_OFFSET 33
#define PIN_ECAP4_REG_BIT 20
#define PIN_ECAP4_REG_OFFSET 12
#define PIN_ECAP5_REG_BIT 29
#define PIN_ECAP5_REG_OFFSET 12
#define PIN_ECAP6_REG_BIT 28
#define PIN_ECAP6_REG_OFFSET 13
#define PIN_EMIF_ADDR_0_REG_BIT  0
#define PIN_EMIF_ADDR_0_REG_OFFSET 22
#define PIN_EMIF_ADDR_1_REG_BIT  0
#define PIN_EMIF_ADDR_1_REG_OFFSET 21
#define PIN_EMIF_ADDR_6_REG_BIT 16
#define PIN_EMIF_ADDR_6_REG_OFFSET 22
#define PIN_EMIF_ADDR_7_REG_BIT  8
#define PIN_EMIF_ADDR_7_REG_OFFSET 22
#define PIN_EMIF_ADDR_8_REG_BIT  0
//#define PIN_EMIF_ADDR_8_REG_BIT 24
#define PIN_EMIF_ADDR_8_REG_OFFSET 22
//#define PIN_EMIF_ADDR_8_REG_OFFSET 23
#define PIN_EMIF_BA_1_REG_BIT 24
#define PIN_EMIF_BA_1_REG_OFFSET 14
#define PIN_EMIF_DATA_11_REG_BIT  8
//#define PIN_EMIF_DATA_11_REG_BIT 9
#define PIN_EMIF_DATA_11_REG_OFFSET  6
//#define PIN_EMIF_DATA_11_REG_OFFSET 6
#define PIN_EMIF_NCS_0_REG_BIT 16
#define PIN_EMIF_NCS_0_REG_OFFSET 10
#define PIN_EMIF_NCS_3_REG_BIT  0
#define PIN_EMIF_NCS_3_REG_OFFSET 11
#define PIN_EMIF_NWE_REG_BIT 16
#define PIN_EMIF_NWE_REG_OFFSET 14
#define PIN_EMIF_RNW_REG_BIT 17
#define PIN_EMIF_RNW_REG_OFFSET 14
#define PIN_ETPWM4A_REG_BIT 2
#define PIN_ETPWM4A_REG_OFFSET 27
#define PIN_EQEP1A_REG_BIT 26
#define PIN_EQEP1A_REG_OFFSET 33
#define PIN_EQEP1B_REG_BIT 11
#define PIN_EQEP1B_REG_OFFSET 9
#define PIN_EQEP1I_REG_BIT 19
#define PIN_EQEP1I_REG_OFFSET 9
#define PIN_EQEP1S_REG_BIT 20
#define PIN_EQEP1S_REG_OFFSET 20
#define PIN_EQEP2A_REG_BIT 21
#define PIN_EQEP2A_REG_OFFSET 4
#define PIN_EQEP2B_REG_BIT 29
#define PIN_EQEP2B_REG_OFFSET 4
#define PIN_EQEP2I_REG_BIT 4
#define PIN_EQEP2I_REG_OFFSET 2
#define PIN_EQEP2S_REG_BIT 11
#define PIN_EQEP2S_REG_OFFSET 19
#define PIN_ETPWM1A_REG_BIT 26
#define PIN_ETPWM1A_REG_OFFSET 2
#define PIN_ETPWM1B_REG_BIT 18
#define PIN_ETPWM1B_REG_OFFSET 3
#define PIN_ETPWM1SYNCI_REG_BIT 1
#define PIN_ETPWM1SYNCI_REG_OFFSET 34
#define PIN_ETPWM1SYNCO_REG_BIT 13
//#define PIN_ETPWM1SYNCO_REG_BIT 2
#define PIN_ETPWM1SYNCO_REG_OFFSET 1
//#define PIN_ETPWM1SYNCO_REG_OFFSET 34
#define PIN_ETPWM2A_REG_BIT 2
#define PIN_ETPWM2A_REG_OFFSET 4
#define PIN_ETPWM2B_REG_BIT 2
#define PIN_ETPWM2B_REG_OFFSET 5
#define PIN_ETPWM3A_REG_BIT 10
#define PIN_ETPWM3A_REG_OFFSET 5
#define PIN_ETPWM3B_REG_BIT 19
#define PIN_ETPWM3B_REG_OFFSET 5
#define PIN_ETPWM4B_REG_BIT 1
#define PIN_ETPWM4B_REG_OFFSET 33
#define PIN_ETPWM5A_REG_BIT 18
#define PIN_ETPWM5A_REG_OFFSET 7
#define PIN_ETPWM5B_REG_BIT 2
#define PIN_ETPWM5B_REG_OFFSET 8
#define PIN_ETPWM6A_REG_BIT 9
#define PIN_ETPWM6A_REG_OFFSET 34
#define PIN_ETPWM6B_REG_BIT 17
#define PIN_ETPWM6B_REG_OFFSET 34
#define PIN_ETPWM7A_REG_BIT 20
#define PIN_ETPWM7A_REG_OFFSET 6
#define PIN_ETPWM7B_REG_BIT 4
#define PIN_ETPWM7B_REG_OFFSET 6
#define PIN_EXTCLKIN_REG_BIT 25
#define PIN_EXTCLKIN_REG_OFFSET 2
#define PIN_GIOA_0_REG_BIT 0
#define PIN_GIOA_0_REG_OFFSET 0
#define PIN_GIOA_1_REG_BIT 1
#define PIN_GIOA_1_REG_OFFSET 0
#define PIN_GIOA_2_REG_BIT 2
#define PIN_GIOA_2_REG_OFFSET 0
#define PIN_GIOA_3_REG_BIT 3
#define PIN_GIOA_3_REG_OFFSET 0
#define PIN_GIOA_4_REG_BIT 4
#define PIN_GIOA_4_REG_OFFSET 0
#define PIN_GIOA_5_REG_BIT 5
#define PIN_GIOA_5_REG_OFFSET 0
#define PIN_GIOA_6_REG_BIT 6
#define PIN_GIOA_6_REG_OFFSET 0
#define PIN_GIOA_7_REG_BIT 7
#define PIN_GIOA_7_REG_OFFSET 0
#define PIN_GIOB_0_REG_BIT 0
#define PIN_GIOB_0_REG_OFFSET 1
#define PIN_GIOB_1_REG_BIT 1
#define PIN_GIOB_1_REG_OFFSET 1
#define PIN_GIOB_2_REG_BIT 2
#define PIN_GIOB_2_REG_OFFSET 1
#define PIN_GIOB_3_REG_BIT 3
#define PIN_GIOB_3_REG_OFFSET 1
#define PIN_GIOB_4_REG_BIT 4
#define PIN_GIOB_4_REG_OFFSET 1
#define PIN_GIOB_5_REG_BIT 5
#define PIN_GIOB_5_REG_OFFSET 1
#define PIN_GIOB_6_REG_BIT 6
#define PIN_GIOB_6_REG_OFFSET 1
#define PIN_GIOB_7_REG_BIT 7
#define PIN_GIOB_7_REG_OFFSET 1
#define PIN_I2C_SCL_REG_BIT 17
#define PIN_I2C_SCL_REG_OFFSET 0
#define PIN_I2C_SDA_REG_BIT 25
#define PIN_I2C_SDA_REG_OFFSET 0
#define PIN_MDCLK_REG_BIT 10
#define PIN_MDCLK_REG_OFFSET 7
#define PIN_MDIO_REG_BIT 10
#define PIN_MDIO_REG_OFFSET 8
#define PIN_MIBSPI1NCS_0_REG_BIT 24
#define PIN_MIBSPI1NCS_0_REG_OFFSET 13
#define PIN_MIBSPI1NCS_1_REG_BIT 16
#define PIN_MIBSPI1NCS_1_REG_OFFSET 20
#define PIN_MIBSPI1NCS_2_REG_BIT  8
#define PIN_MIBSPI1NCS_2_REG_OFFSET  8
#define PIN_MIBSPI1NCS_3_REG_BIT 24
#define PIN_MIBSPI1NCS_3_REG_OFFSET  9
#define PIN_MIBSPI1NCS_4_REG_BIT 17
#define PIN_MIBSPI1NCS_4_REG_OFFSET 8
#define PIN_MIBSPI1NCS_5_REG_BIT 25
#define PIN_MIBSPI1NCS_5_REG_OFFSET 11
#define PIN_MIBSPI1NENA_REG_BIT 16
#define PIN_MIBSPI1NENA_REG_OFFSET 12
#define PIN_MIBSPI1SIMO_1_REG_BIT 1
#define PIN_MIBSPI1SIMO_1_REG_OFFSET 14
#define PIN_MIBSPI1SOMI_1_REG_BIT 25
#define PIN_MIBSPI1SOMI_1_REG_OFFSET 13
#define PIN_MIBSPI3CLK_REG_BIT 24
#define PIN_MIBSPI3CLK_REG_OFFSET 33
#define PIN_MIBSPI3NCS_0_REG_BIT 16
#define PIN_MIBSPI3NCS_0_REG_OFFSET  9
#define PIN_MIBSPI3NCS_1_REG_BIT  8
#define PIN_MIBSPI3NCS_1_REG_OFFSET  7
#define PIN_MIBSPI3NCS_2_REG_BIT 24
#define PIN_MIBSPI3NCS_2_REG_OFFSET  0
#define PIN_MIBSPI3NCS_3_REG_BIT 16
#define PIN_MIBSPI3NCS_3_REG_OFFSET  0
#define PIN_MIBSPI3NCS_4_REG_BIT 9
#define PIN_MIBSPI3NCS_4_REG_OFFSET 1
#define PIN_MIBSPI3NCS_5_REG_BIT 9
#define PIN_MIBSPI3NCS_5_REG_OFFSET 9
#define PIN_MIBSPI3NENA_REG_BIT  8
#define PIN_MIBSPI3NENA_REG_OFFSET  9
#define PIN_MIBSPI3SIMO_0_REG_BIT 16
#define PIN_MIBSPI3SIMO_0_REG_OFFSET 33
#define PIN_MIBSPI3SOMI_0_REG_BIT  8
#define PIN_MIBSPI3SOMI_0_REG_OFFSET 33
#define PIN_MIBSPI5CLK_REG_BIT 16
#define PIN_MIBSPI5CLK_REG_OFFSET 13
#define PIN_MIBSPI5NCS_0_REG_BIT  0
#define PIN_MIBSPI5NCS_0_REG_OFFSET 27
#define PIN_MIBSPI5NENA_REG_BIT 24
#define PIN_MIBSPI5NENA_REG_OFFSET 12
#define PIN_MIBSPI5SIMO_0_REG_BIT  8
#define PIN_MIBSPI5SIMO_0_REG_OFFSET 13
#define PIN_MIBSPI5SOMI_0_REG_BIT  0
#define PIN_MIBSPI5SOMI_0_REG_OFFSET 13
#define PIN_MIBSPI5SOMI_1_REG_BIT 28
#define PIN_MIBSPI5SOMI_1_REG_OFFSET 12
#define PIN_MIBSPI5SOMI_2_REG_BIT 12
#define PIN_MIBSPI5SOMI_2_REG_OFFSET 13
#define PIN_MII_COL_REG_BIT 18
#define PIN_MII_COL_REG_OFFSET 20
#define PIN_MII_CRS_REG_BIT 17
#define PIN_MII_CRS_REG_OFFSET 17
#define PIN_MII_RX_AVCLK4_REG_BIT 11
#define PIN_MII_RX_AVCLK4_REG_OFFSET 14
#define PIN_MII_RX_DV_REG_BIT 9
#define PIN_MII_RX_DV_REG_OFFSET 19
#define PIN_MII_RX_ER_REG_BIT 1
#define PIN_MII_RX_ER_REG_OFFSET 10
#define PIN_MII_RXCLK_REG_BIT 9
#define PIN_MII_RXCLK_REG_OFFSET 14
#define PIN_MII_RXD_0_REG_BIT 26
#define PIN_MII_RXD_0_REG_OFFSET 11
#define PIN_MII_RXD_1_REG_BIT 1
#define PIN_MII_RXD_1_REG_OFFSET 12
#define PIN_MII_RXD_2_REG_BIT 18
#define PIN_MII_RXD_2_REG_OFFSET 12
#define PIN_MII_RXD_3_REG_BIT 26
#define PIN_MII_RXD_3_REG_OFFSET 12
#define PIN_MII_TX_AVCLK4_REG_BIT 3
#define PIN_MII_TX_AVCLK4_REG_OFFSET 17
#define PIN_MII_TX_CLK_REG_BIT 1
#define PIN_MII_TX_CLK_REG_OFFSET 17
#define PIN_MII_TXD_0_REG_BIT 2
#define PIN_MII_TXD_0_REG_OFFSET 13
#define PIN_MII_TXD_1_REG_BIT 10
#define PIN_MII_TXD_1_REG_OFFSET 13
#define PIN_MII_TXD_2_REG_BIT 26
#define PIN_MII_TXD_2_REG_OFFSET 13
#define PIN_MII_TXD_3_REG_BIT 2
#define PIN_MII_TXD_3_REG_OFFSET 14
#define PIN_MII_TXEN_REG_BIT 18
#define PIN_MII_TXEN_REG_OFFSET 13
#define PIN_N2HET1_0_REG_BIT  0
#define PIN_N2HET1_0_REG_OFFSET  2
#define PIN_N2HET1_01_REG_BIT 1
#define PIN_N2HET1_01_REG_OFFSET  2
#define PIN_N2HET1_02_REG_BIT  2
#define PIN_N2HET1_02_REG_OFFSET  2
#define PIN_N2HET1_03_REG_BIT 3
#define PIN_N2HET1_03_REG_OFFSET  2
#define PIN_N2HET1_04_REG_BIT  4
#define PIN_N2HET1_04_REG_OFFSET 2
#define PIN_N2HET1_05_REG_BIT 5
#define PIN_N2HET1_05_REG_OFFSET  2
#define PIN_N2HET1_06_REG_BIT 6
#define PIN_N2HET1_06_REG_OFFSET  2
#define PIN_N2HET1_07_REG_BIT  7
#define PIN_N2HET1_07_REG_OFFSET  2
#define PIN_N2HET1_08_REG_BIT  8
#define PIN_N2HET1_08_REG_OFFSET 2
#define PIN_N2HET1_09_REG_BIT 9
#define PIN_N2HET1_09_REG_OFFSET 2
#define PIN_N2HET1_10_REG_BIT  10
#define PIN_N2HET1_10_REG_OFFSET 2
#define PIN_N2HET1_11_REG_BIT  11
#define PIN_N2HET1_11_REG_OFFSET  2
#define PIN_N2HET1_12_REG_BIT 12
#define PIN_N2HET1_12_REG_OFFSET 2
#define PIN_N2HET1_13_REG_BIT  13
#define PIN_N2HET1_13_REG_OFFSET 2
#define PIN_N2HET1_14_REG_BIT 14
#define PIN_N2HET1_14_REG_OFFSET 2 //PIN14 added manually
#define PIN_N2HET1_15_REG_BIT 15
#define PIN_N2HET1_15_REG_OFFSET 2
#define PIN_N2HET1_16_REG_BIT  16
#define PIN_N2HET1_16_REG_OFFSET 2
#define PIN_N2HET1_17_REG_BIT 17
#define PIN_N2HET1_17_REG_OFFSET 2
#define PIN_N2HET1_18_REG_BIT  18
#define PIN_N2HET1_18_REG_OFFSET 2
#define PIN_N2HET1_19_REG_BIT 19
#define PIN_N2HET1_19_REG_OFFSET 2
#define PIN_N2HET1_20_REG_BIT 20
#define PIN_N2HET1_20_REG_OFFSET 2
#define PIN_N2HET1_21_REG_BIT 21
#define PIN_N2HET1_21_REG_OFFSET 2
#define PIN_N2HET1_22_REG_BIT 22
#define PIN_N2HET1_22_REG_OFFSET 2 //PIN22 added manually
#define PIN_N2HET1_23_REG_BIT 23
#define PIN_N2HET1_23_REG_OFFSET 2
#define PIN_N2HET1_24_REG_BIT 24
#define PIN_N2HET1_24_REG_OFFSET 2
#define PIN_N2HET1_25_REG_BIT 25
#define PIN_N2HET1_25_REG_OFFSET 2
#define PIN_N2HET1_26_REG_BIT  26
#define PIN_N2HET1_26_REG_OFFSET 2
#define PIN_N2HET1_27_REG_BIT 27
#define PIN_N2HET1_27_REG_OFFSET 2
#define PIN_N2HET1_28_REG_BIT  28
#define PIN_N2HET1_28_REG_OFFSET 2
#define PIN_N2HET1_29_REG_BIT 29
#define PIN_N2HET1_29_REG_OFFSET 2
#define PIN_N2HET1_30_REG_BIT  30
#define PIN_N2HET1_30_REG_OFFSET 2
#define PIN_N2HET1_31_REG_BIT 31
#define PIN_N2HET1_31_REG_OFFSET 2
#define PIN_N2HET2_0_REG_BIT 3
#define PIN_N2HET2_0_REG_OFFSET 2
#define PIN_N2HET2_1_REG_BIT 1
#define PIN_N2HET2_1_REG_OFFSET 22
#define PIN_N2HET2_10_REG_BIT 28
#define PIN_N2HET2_10_REG_OFFSET 4
#define PIN_N2HET2_11_REG_BIT 18
#define PIN_N2HET2_11_REG_OFFSET 22
#define PIN_N2HET2_12_REG_BIT 18
#define PIN_N2HET2_12_REG_OFFSET 5
#define PIN_N2HET2_13_REG_BIT 10
#define PIN_N2HET2_13_REG_OFFSET 22
#define PIN_N2HET2_14_REG_BIT 3
#define PIN_N2HET2_14_REG_OFFSET 6
#define PIN_N2HET2_15_REG_BIT 2
//#define PIN_N2HET2_15_REG_BIT 26
#define PIN_N2HET2_15_REG_OFFSET 22
//#define PIN_N2HET2_15_REG_OFFSET 23
#define PIN_N2HET2_16_REG_BIT 17
#define PIN_N2HET2_16_REG_OFFSET 6
#define PIN_N2HET2_18_REG_BIT 10
#define PIN_N2HET2_18_REG_OFFSET 1
#define PIN_N2HET2_2_REG_BIT 17
#define PIN_N2HET2_2_REG_OFFSET 2
#define PIN_N2HET2_3_REG_BIT 1
#define PIN_N2HET2_3_REG_OFFSET 21
#define PIN_N2HET2_4_REG_BIT 17
#define PIN_N2HET2_4_REG_OFFSET 3
#define PIN_N2HET2_5_REG_BIT 25
#define PIN_N2HET2_5_REG_OFFSET 14
#define PIN_N2HET2_6_REG_BIT 1
#define PIN_N2HET2_6_REG_OFFSET 4
#define PIN_N2HET2_7_REG_BIT 18
#define PIN_N2HET2_7_REG_OFFSET 10
#define PIN_N2HET2_8_REG_BIT 20
#define PIN_N2HET2_8_REG_OFFSET 4
#define PIN_N2HET2_9_REG_BIT 2
#define PIN_N2HET2_9_REG_OFFSET 11

/* Defines for functional GIO pins where the default is another function */
/* 0xFF where multiplexing is not needed */

/* N2HET1 [0] */
#define PIN_N2HET1_0_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_0_MULTI_REG_BIT 0xFF



/* N2HET1 [1] */
#define PIN_N2HET1_01_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_01_MULTI_REG_BIT 0xFF



/* N2HET1 [2] */
#define PIN_N2HET1_02_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_02_MULTI_REG_BIT 0xFF



/* N2HET1 [3] */
#define PIN_N2HET1_03_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_03_MULTI_REG_BIT 0xFF



/* N2HET1 [4] */
#define PIN_N2HET1_04_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_04_MULTI_REG_BIT 0xFF



/* N2HET1 [5] */
#define PIN_N2HET1_05_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_05_MULTI_REG_BIT 0xFF



/* N2HET1 [6] */
#define PIN_N2HET1_06_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_06_MULTI_REG_BIT 0xFF



/* N2HET1 [7] */
#define PIN_N2HET1_07_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_07_MULTI_REG_BIT 0xFF



