leduynguyen/My_AUTOSAR_Project/MCAL/core/arch/arm/arm_cr4/drivers/tms570ls12x_portdefs.h
/* N2HET1 [8] */
#define PIN_N2HET1_08_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_08_MULTI_REG_BIT 0xFF



/* N2HET1 [9] */
#define PIN_N2HET1_09_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_09_MULTI_REG_BIT 0xFF



/* N2HET1 [10] */
#define PIN_N2HET1_10_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_10_MULTI_REG_BIT 0xFF



/* N2HET1 [11] */
#define PIN_N2HET1_11_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_11_MULTI_REG_BIT 0xFF



/* N2HET1 [12] */
#define PIN_N2HET1_12_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_12_MULTI_REG_BIT 0xFF



/* N2HET1 [13] */
#define PIN_N2HET1_13_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_13_MULTI_REG_BIT 0xFF



/* N2HET1 [14] */
#define PIN_N2HET1_14_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_14_MULTI_REG_BIT 0xFF



/* N2HET1 [15] */
#define PIN_N2HET1_15_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_15_MULTI_REG_BIT 0xFF



/* N2HET1 [16] */
#define PIN_N2HET1_16_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_16_MULTI_REG_BIT 0xFF



/* N2HET1 [17] */
#define PIN_N2HET1_17_MULTI_REG_OFFSET 20
#define PIN_N2HET1_17_MULTI_REG_BIT 17


/* N2HET1 [18] */
#define PIN_N2HET1_18_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_18_MULTI_REG_BIT 0xFF



/* N2HET1 [19] */
#define PIN_N2HET1_19_MULTI_REG_OFFSET 8
#define PIN_N2HET1_19_MULTI_REG_BIT 9


/* N2HET1 [20] */
#define PIN_N2HET1_20_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_20_MULTI_REG_BIT 0xFF



/* N2HET1 [21] */
#define PIN_N2HET1_21_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_21_MULTI_REG_BIT 0xFF



/* N2HET1 [22] */
#define PIN_N2HET1_22_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_22_MULTI_REG_BIT 0xFF



/* N2HET1 [23] */
#define PIN_N2HET1_23_MULTI_REG_OFFSET 12
#define PIN_N2HET1_23_MULTI_REG_BIT 17


/* N2HET1 [24] */
#define PIN_N2HET1_24_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_24_MULTI_REG_BIT 0xFF


/* N2HET1 [25] */
#define PIN_N2HET1_25_MULTI_REG_OFFSET 7
#define PIN_N2HET1_25_MULTI_REG_BIT 9

/* N2HET1 [26] */
#define PIN_N2HET1_26_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_26_MULTI_REG_BIT 0xFF

/* N2HET1 [27] */
#define PIN_N2HET1_27_MULTI_REG_OFFSET 0
#define PIN_N2HET1_27_MULTI_REG_BIT 26

/* N2HET1 [28] */
#define PIN_N2HET1_28_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_28_MULTI_REG_BIT 0xFF

/* N2HET1 [29] */
#define PIN_N2HET1_29_MULTI_REG_OFFSET 0
#define PIN_N2HET1_29_MULTI_REG_BIT 18

/* N2HET1 [30] */
#define PIN_N2HET1_30_MULTI_REG_OFFSET 0xFF
#define PIN_N2HET1_30_MULTI_REG_BIT 0xFF

/* N2HET1 [31] */
#define PIN_N2HET1_31_MULTI_REG_OFFSET 9
#define PIN_N2HET1_31_MULTI_REG_BIT 10

#define PIN_NTZ1_REG_BIT 19
#define PIN_NTZ1_REG_OFFSET 0
#define PIN_NTZ2_REG_BIT 27
#define PIN_NTZ2_REG_OFFSET 0
#define PIN_NTZ3_REG_BIT 4
#define PIN_NTZ3_REG_OFFSET 17
#define PIN_RMII_CRS_DV_REG_BIT 18
#define PIN_RMII_CRS_DV_REG_OFFSET 17
#define PIN_RMII_REFCLK_REG_BIT 10
#define PIN_RMII_REFCLK_REG_OFFSET 14
#define PIN_RMII_RX_ER_REG_BIT 2
#define PIN_RMII_RX_ER_REG_OFFSET 10
#define PIN_RMII_RXD_0_REG_BIT 27
#define PIN_RMII_RXD_0_REG_OFFSET 11
#define PIN_RMII_RXD_1_REG_BIT 2
#define PIN_RMII_RXD_1_REG_OFFSET 12
#define PIN_RMII_TXD_0_REG_BIT 3
#define PIN_RMII_TXD_0_REG_OFFSET 13
#define PIN_RMII_TXD_1_REG_BIT 11
#define PIN_RMII_TXD_1_REG_OFFSET 13
#define PIN_RMII_TXEN_REG_BIT 19
#define PIN_RMII_TXEN_REG_OFFSET 13
#define PIN_SCIRX_REG_BIT 17
#define PIN_SCIRX_REG_OFFSET 7
#define PIN_SCITX_REG_BIT 1
#define PIN_SCITX_REG_OFFSET 8
#define PIN_SPI2NCS_1_REG_BIT 1
#define PIN_SPI2NCS_1_REG_OFFSET 29
#define PIN_SPI2NENA_REG_BIT  0
#define PIN_SPI2NENA_REG_OFFSET 29
#define PIN_SPI4CLK_REG_BIT 1
#define PIN_SPI4CLK_REG_OFFSET 5
#define PIN_SPI4NCS_0_REG_BIT 25
#define PIN_SPI4NCS_0_REG_OFFSET 4
#define PIN_SPI4NENA_REG_BIT 17
#define PIN_SPI4NENA_REG_OFFSET 4
#define PIN_SPI4SIMO_REG_BIT 9
#define PIN_SPI4SIMO_REG_OFFSET 5
#define PIN_SPI4SOMI_REG_BIT 17
#define PIN_SPI4SOMI_REG_OFFSET 5

/* Below: special bit offsets for SPI5 pins when used
 * as DIO
 *
 * The REG_OFFSET defines are not used in the MCAL and
 * are just there to keep the generators happy
 */
#define PIN_MIBSPI5NCS_0_REG_BIT_DIO  0
#define PIN_MIBSPI5NCS_1_REG_BIT_DIO  1
#define PIN_MIBSPI5NCS_2_REG_BIT_DIO  2
#define PIN_MIBSPI5NCS_3_REG_BIT_DIO  3
#define PIN_MIBSPI5NENA_REG_BIT_DIO   8
#define PIN_MIBSPI5CLK_REG_BIT_DIO    9
#define PIN_MIBSPI5SIMO_0_REG_BIT_DIO 16
#define PIN_MIBSPI5SIMO_1_REG_BIT_DIO 17
#define PIN_MIBSPI5SIMO_2_REG_BIT_DIO 18
#define PIN_MIBSPI5SIMO_3_REG_BIT_DIO 19
#define PIN_MIBSPI5SOMI_0_REG_BIT_DIO 24
#define PIN_MIBSPI5SOMI_1_REG_BIT_DIO 25
#define PIN_MIBSPI5SOMI_2_REG_BIT_DIO 26
#define PIN_MIBSPI5SOMI_3_REG_BIT_DIO 27

/* The REG_OFFSETS below are for those pins that are only in this
 * file because of GIO functionality. They do not need functional
 * toggling.
 * Additions are: CS 1-3, SOMI3, SIMO 1-3
 */

#define PIN_MIBSPI5NCS_1_REG_OFFSET  0
#define PIN_MIBSPI5NCS_2_REG_OFFSET  0
#define PIN_MIBSPI5NCS_3_REG_OFFSET  0
#define PIN_MIBSPI5SOMI_3_REG_OFFSET 0
#define PIN_MIBSPI5SIMO_1_REG_OFFSET 0
#define PIN_MIBSPI5SIMO_2_REG_OFFSET 0
#define PIN_MIBSPI5SIMO_3_REG_OFFSET 0



#endif /* TMS570_PORTDEFS_H_ */
